backend/app/controllers/api/v1/auth/registrations_controller.rb

        def create
          user = User.new(user_params)

          if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ('Mario Matute', 'mario@newsflow.com', '2026-08-14 20:19:53.256713', '2026-08-14 20:19:53.256713', '$2a$12$iux35V9oDGkakBBYjBsmgeUnxNskcyKPKbPZ/QnQwnSTypg.YH28O') RETURNING "id"