backend/app/controllers/api/v1/auth/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'johan@newsflow.com' LIMIT 1
---
        def create
          email = params[:email].to_s.strip.downcase
          user = User.find_by(email: email)