backend/app/controllers/application_controller.rb

  def current_user
    return @current_user if defined?(@current_user)

    authorization = request.headers["Authorization"].to_s
    token = authorization.match(/\ABearer\s+(.+)\z/i)&.captures&.first
    return @current_user = nil if token.blank?

    payload = JsonWebToken.decode(token)
    return @current_user = nil if payload[:sub].blank?

    @current_user = User.find(payload[:sub])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1