backend/app/controllers/api/v1/communities_controller.rb

SELECT "communities".* FROM "communities" ORDER BY "communities"."created_at" DESC
---
      def index
        communities = Community.order(created_at: :desc)

        render json: communities.map { |community| community_json(community) }

SELECT "communities".* FROM "communities" WHERE "communities"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."community_id" = 1 ORDER BY "posts"."created_at" DESC
---
      def show
        community = Community.find(params[:id])

        render json: {
          id: community.id,
          name: community.name,
          slug: community.slug,
          description: community.description,
          topic: community.topic,
          posts: community.posts.order(created_at: :desc).map do |post|

SELECT COUNT(*) FROM "posts" WHERE "posts"."community_id" = 3
---
      def community_json(community)
        {
          id: community.id,
          name: community.name,
          slug: community.slug,
          description: community.description,
          topic: community.topic,
          posts_count: community.posts.count