backend/app/controllers/api/v1/comments_controller.rb

      def index
        comments = @post.comments
                        .includes(:user)
                        .order(created_at: :asc)

        render json: comments.map { |comment| comment_json(comment) }
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 ORDER BY "comments"."created_at" ASC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)

      def create
        comment = @post.comments.new(comment_params)

        if comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (2, 1, 'Me parece una publicación muy interesante.', '2026-08-13 00:54:25.182747', '2026-08-13 00:54:25.182747') RETURNING "id"