backend/app/controllers/api/v1/feeds_controller.rb

      def show
        user = User.find(params[:user_id])
        topics = user.interests.pluck(:name).map(&:downcase)

        posts = Post.includes(:user, :community)
                    .where(status: :published)
                    .order(created_at: :desc)

        posts = posts.sort_by do |post|
          matches_interest = topics.include?(post.community.topic.to_s.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "interests"."name" FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = 1
SELECT "communities".* FROM "communities" WHERE "communities"."id" IN (1, 3, 2)
SELECT "posts".* FROM "posts" WHERE "posts"."status" = 1 ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
SELECT "communities".* FROM "communities" ORDER BY "communities"."created_at" DESC