backend/app/controllers/api/v1/interests_controller.rb

      def index
        interests = Interest.order(:name)
---
SELECT "interests".* FROM "interests" ORDER BY "interests"."name" ASC