backend/app/controllers/api/v1/posts_controller.rb

      def index
        posts = Post.includes(:user, :community)
                    .order(created_at: :desc)

        if params[:filter] == 'news'
          posts = posts.where.not(post_type: :critique)
        elsif params[:filter] == 'critiques' || params[:post_type] == 'critique'
          posts = posts.where(post_type: :critique)
        elsif params[:post_type].present?
          posts = posts.where(post_type: params[:post_type])
        end

        if params[:community_id].present?
          posts = posts.where(community_id: params[:community_id])
        end

        render json: posts.map { |post| post_json(post) }
---
SELECT "communities".* FROM "communities" ORDER BY "communities"."created_at" DESC
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
SELECT "communities".* FROM "communities" WHERE "communities"."id" IN (3, 2, 1)
SELECT "communities".* FROM "communities" WHERE "communities"."id" IN (1, 3, 2)
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1

      def show
        post = Post.includes(:user, :community, :comments, :reactions)
                   .find(params[:id])

        render json: post_json(post).merge(
          comments_count: post.comments.count,
          reactions_count: post.reactions.count
        )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 5 LIMIT 1
SELECT "communities".* FROM "communities" WHERE "communities"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 5
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 5
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."post_id" = 5

      def create
        post = Post.new(post_params)

        if params[:community_id].present?
          post.community_id = params[:community_id]
        end

        if post.save
---
INSERT INTO "posts" ("user_id", "community_id", "title", "content", "post_type", "status", "published_at", "created_at", "updated_at") VALUES (1, 3, 'Prueba 2', 'Prueba de la Prueba  de la prueba', 2, 1, NULL, '2026-08-14 20:58:40.032532', '2026-08-14 20:58:40.032532') RETURNING "id"