backend/app/controllers/api/v1/reactions_controller.rb

SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = 1 ORDER BY "reactions"."created_at" DESC
---
      def index
        reactions = @post.reactions
                         .includes(:user)
                         .order(created_at: :desc)

        render json: reactions.map { |reaction| reaction_json(reaction) }

SELECT "reactions".* FROM "reactions" WHERE "reactions"."post_id" = 8 AND "reactions"."user_id" = 1 LIMIT 1
---
      def create
        reaction = @post.reactions.find_or_initialize_by(
          user_id: reaction_params[:user_id]
        )

SELECT "reactions".* FROM "reactions" WHERE "reactions"."id" = 4 LIMIT 1
DELETE FROM "reactions" WHERE "reactions"."id" = 4
---
      def destroy
        reaction = Reaction.find(params[:id])
        reaction.destroy!