backend/app/controllers/api/v1/reports_controller.rb

      def index
        reports = if params[:post_id].present?
                    Post.find(params[:post_id]).reports
                  else
                    Report.all
                  end

        reports = reports.includes(:user, :post)
                         .order(status: :asc, created_at: :desc)

        render json: reports.map { |report| report_json(report) }
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (5, 6, 7, 1)
SELECT "reports".* FROM "reports" WHERE "reports"."post_id" = 1 ORDER BY "reports"."created_at" DESC
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (7, 6, 5, 1)

      def create
        post = Post.find(params[:post_id])
        report = post.reports.new(report_params)
        report.user = current_user

        if report.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 LIMIT 1
INSERT INTO "reports" ("user_id", "post_id", "reason", "status", "reviewed_at", "created_at", "updated_at") VALUES (1, 7, 'mala', 0, NULL, '2026-08-14 22:03:47.956547', '2026-08-14 22:03:47.956547') RETURNING "id"

      def update
        report = Report.find(params[:id])

        if report.update(
          status: update_params[:status],
          reviewed_at: Time.current
        )
          report.post.update(status: :hidden) if report.action_taken?
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = 1 LIMIT 1
UPDATE "reports" SET "status" = 1, "reviewed_at" = '2026-08-13 02:03:10.433726', "updated_at" = '2026-08-13 02:03:10.434133' WHERE "reports"."id" = 1
UPDATE "posts" SET "status" = 2, "updated_at" = '2026-08-13 02:03:29.638671' WHERE "posts"."id" = 1