backend/app/controllers/api/v1/saved_posts_controller.rb

SELECT "saved_posts".* FROM "saved_posts" WHERE "saved_posts"."user_id" = 1 ORDER BY "saved_posts"."created_at" DESC
INSERT INTO "saved_posts" ("user_id", "post_id", "created_at", "updated_at") VALUES (1, 7, '2026-08-14 22:03:41.592733', '2026-08-14 22:03:41.592733') RETURNING "id"
SELECT "posts".* FROM "posts" WHERE "posts"."id" IN (5, 7)
SELECT 1 AS one FROM "saved_posts" WHERE "saved_posts"."user_id" = 1 AND "saved_posts"."id" != 3 AND "saved_posts"."post_id" = 7 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 LIMIT 1
SELECT "saved_posts".* FROM "saved_posts" WHERE "saved_posts"."user_id" = 1 AND "saved_posts"."post_id" = 7 LIMIT 1
---
      def index
        saved_posts = current_user.saved_posts
                                  .includes(post: [:user, :community])
                                  .order(created_at: :desc)
        posts = saved_posts.map(&:post).compact
        serialized_posts = serialize_posts(posts).index_by { |post| post[:id] }

        valid_saved_posts = saved_posts.select { |sp| sp.post.present? && serialized_posts.key?(sp.post_id) }

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
SELECT "saved_posts".* FROM "saved_posts" WHERE "saved_posts"."user_id" = 1 AND "saved_posts"."post_id" = 1 LIMIT 1
---
      def create
        post = Post.find(params[:post_id])
        saved_post = current_user.saved_posts.find_or_initialize_by(post: post)

SELECT "saved_posts".* FROM "saved_posts" WHERE "saved_posts"."id" = 1 LIMIT 1
DELETE FROM "saved_posts" WHERE "saved_posts"."id" = 1
---
      def destroy
        saved_post = if params[:post_id].present?
                       current_user.saved_posts.find_by(post_id: params[:post_id])
                     else
                       current_user.saved_posts.find_by(id: params[:id])
                     end
        saved_post&.destroy!