backend/app/controllers/api/v1/user_interests_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "interests".* FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = 1 ORDER BY "interests"."name" ASC
---
      def show
        user = User.find(params[:user_id])

        render json: user.interests
                         .order(:name)
                         .as_json(only: [:id, :name, :slug])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "user_interests" WHERE "user_interests"."user_id" = 1
INSERT INTO "user_interests" ("user_id", "interest_id", "created_at", "updated_at") VALUES (1, 1, '2026-08-14 19:50:41.837063', '2026-08-14 19:50:41.837063') RETURNING "id"
SELECT "interests".* FROM "interests" INNER JOIN "user_interests" ON "interests"."id" = "user_interests"."interest_id" WHERE "user_interests"."user_id" = 1 ORDER BY "interests"."name" ASC
---
      def update
        user = User.find(params[:user_id])
        interest_ids = params.require(:interest_ids)

        user.transaction do
          user.user_interests.delete_all

          interest_ids.each do |interest_id|
            user.user_interests.create!(interest_id: interest_id)
          end
        end

        render json: user.interests
                         .order(:name)
                         .as_json(only: [:id, :name, :slug])